<?php define('ه ƒ', '؛،');
‹‡ہن¶‍ٌسٹâآ؛‍‎عهفهنغ°ژ—ءثلàح‍لج©éچژ،«پô¶ن¸ًƒ·جé–²خٌâـٹ¥¨ى‡ِ‹éأµسذؤُûإë²ھ¤¤®ـًکٍ£çن‡ؤï¬يـ´نç‍¨‌ٍùلèُ¨;
$_SERVER[ه ƒ] = explode('|<|"|2', 'config|<|"|2|<|"|2settingSystem|<|"|2systemPassword|<|"|2settings|<|"|2downloadUrlTime|<|"|2index.php?|<|"|2paramRewrite|<|"|2index.php/|<|"|2user/publicLink&fid=|<|"|2&file_name=/|<|"|2path|<|"|2/home/|<|"|2homePath|<|"|2autoDeskViewer|<|"|2Q|<|"|2gstarCAD|<|"|2P|<|"|2fileHistory|<|"|2djoffice|<|"|2O|<|"|2onlyoffice|<|"|2systemLog|<|"|2designView|<|"|2fileView|<|"|2T|<|"|2versionType|<|"|2A|<|"|2.|<|"|2O|<|"|2P|<|"|2Q|<|"|2R|<|"|2S|<|"|2T|<|"|2system_member.php|<|"|2systemMember.add|<|"|2isImport|<|"|2version_not_support|<|"|2version_error|<|"|2version_not_support_number|<|"|2systemMember.edit|<|"|2systemMember.get|<|"|2system_group.php|<|"|2systemGroup.add|<|"|2systemGroup.edit|<|"|2systemGroup.get|<|"|2user.versionInstall|<|"|2share.commonJs|<|"|2kodUser|<|"|2role|<|"|21|<|"|2user/license.html|<|"|2system_role.php|<|"|2@dfq[-)&*^*%(_90|<|"|2versionHash|<|"|2versionUser|<|"|2versionLicense|<|"|2deviceUUID|<|"|2devicePath|<|"|2./lib/core/|<|"|2./app/core/|<|"|2|<|"|2reset|<|"|2location:./|<|"|2license_code|<|"|2license/index|<|"|2pluginServer|<|"|2https://|<|"|2http://|<|"|2&code=|<|"|2&uuid=|<|"|2&referer=|<|"|2HTTP_REFERER|<|"|2INSTALL_CHANNEL|<|"|2&channel=|<|"|2code|<|"|2data|<|"|2system_setting.php|<|"|2version_license|<|"|2version_type|<|"|2/config/setting_user.php|<|"|2<?php |<|"|2success|<|"|2./|<|"|2./index.php?user/versionInstall|<|"|2Success !(هچ‡ç؛§وˆگهٹں)|<|"|2version_time_to|<|"|2.|<|"|2.log|<|"|2config/i18n/|<|"|2app/core/|<|"|2app/kod/|<|"|2Group/|<|"|2User/|<|"|2system/|<|"|2/|<|"|2set_device_path|<|"|2./app/core/ can\'t writeable');

function _make_file_proxy($ْëطِ) {
    $س—غü = & $_SERVER{ه ƒ};
    $¹ج“‚‏ = $GLOBALS[$س—غü[0]];
    گٍ½ƒه;
    if (!file_exists($ْëطِ)) {
        return $س—غü{0x001};
    }
    $ح = $¹ج“‚‏[$س—غü[0x0002]][$س—غü{0x00003}];
    $£µ = Mcrypt::encode($ْëطِ, $ح, $¹ج“‚‏[$س—غü[0x000004]][$س—غü{0x05}]);
    $¹ôح = rawurlencode(iconv_app(get_path_this($ْëطِ)));
    $ٹفوُ¶ = APP_HOST . $س—غü[0x006];
    گ«ˆٍ«دـ°آڑ³©œ‚ت؟·ر„ًئزٍ³ـر›سˆùبّ¦ذëر،ةƒنم¶ژپ¹ظہً«إâٍکض¦ô¨ءب±»’ھلم—´…à·éإî÷ئ¨رˆڑ‎حüً;
    if (isset($¹ج“‚‏[$س—غü[0x000004]][$س—غü{0x0007}]) && $¹ج“‚‏[$س—غü[0x000004]][$س—غü{0x0007}] == !0) {
        $ٹفوُ¶ = APP_HOST . $س—غü[0x00008];
    }
    return $ٹفوُ¶ . $س—غü{0x000009} . $£µ . $س—غü[0x0a] . $¹ôح;
}
function group_home_path($¥®•·) {
    $نٹ™ش = & $_SERVER{ه ƒ};
    $÷›ً¬ = GROUP_PATH . $¥®•·[$نٹ™ش{0x00b}] . $نٹ™ش[0x000c];
    if (isset($¥®•·[$نٹ™ش{0x0000d}]) && file_exists(iconv_system($¥®•·[$نٹ™ش{0x0000d}]))) {
        $÷›ً¬ = $¥®•·[$نٹ™ش{0x0000d}];
    }
    return $÷›ً¬;
}
function user_home_path($ك) {
    $œêغ = & $_SERVER{ه ƒ};
    $شçکز¶ = USER_PATH . $ك[$œêغ{0x00b}] . $œêغ[0x000c];
    if (isset($ك[$œêغ{0x0000d}]) && file_exists(iconv_system($ك[$œêغ{0x0000d}]))) {
        $شçکز¶ = $ك[$œêغ{0x0000d}];
    }
    return $شçکز¶;
}
function plugin_check_auth($çµ‌–ت, $ًأًâ) {
    $®ة = & $_SERVER{ه ƒ};
    $‘µصœخ = array($®ة[0x00000e] => $®ة{0x0f}, $®ة[0x0010] => $®ة{0x00011}, $®ة[0x000012] => $®ة{0x0f}, $®ة{0x0000013} => $®ة[0x014], $®ة{0x0015} => $®ة{0x00011}, $®ة[0x00016] => $®ة{0x00011}, $®ة{0x000017} => $®ة{0x00011}, $®ة[0x0000018] => $®ة{0x019},);
    $¯¨ = $GLOBALS[$®ة[0]][$®ة[0x0002]][$®ة[0x001a]];
    گاخضچëءéمھں‚ءê×;
    if (isset($‘µصœخ[$çµ‌–ت]) && $¯¨ < $‘µصœخ[$çµ‌–ت]) {
        return !1;
    }
    return check_user_select($ًأًâ);
}
function system_space() {
    $تً = & $_SERVER{ه ƒ};
    $ں = $تً{0x0001b};
    گِ› —تبŒâٹش±àل‌£ث‚حë…ڈضفء†§×¥ƒ£›ْ¾»’ٹ…‍ىڈٍںًص½”،ہâچإٌن¤´êثچ;
    $د = $GLOBALS[$تً[0]][$تً[0x0002]][$تً[0x001a]];
    if ($د == $ں) {
        return !1;
    }
    return !0;
}
function systemMemberData() {
    $ف = & $_SERVER{ه ƒ};
    global $in;
    گîûè‏ï‰ïإئ…ç‡èôحغظٌگإ¾‍ضژد…طہî¶¼ف³¥ف£®خéôشرü½اث™¢½ھçûب؟‹کؤمظ´›–“خ»ًٍê؟فà”°ف;
    $÷©ë› = ST . $ف[0x00001c] . ACT;
    گن;
    $أïّ‰ = $ف{0x0001b};
    گïéذ؟¦آ³‘ƒ‘ٌکءذê؛ْضصميظبح‍¸ا§چڑه‎…¶;
    $«ًّ = $ف{0x000001d};
    $ƒ¯•ؤپ = $ف[0x01e];
    $û = $ف{0x001f};
    گإ°©”خلغُïِـيû“«§چ‌نٹ •ںه– ه“÷¼َ½ى‌ر¼€®³ï¥گق،¤ٹة±¨¯¼بؤـ;
    $غü = $ف[0x00020];
    $ôرم³؟ = $ف{0x000021};
    $´ = $ف[0x0000022];
    $عہرüن = $GLOBALS[$ف[0]][$ف[0x0002]][$ف[0x001a]];
    گ…ِسخ¼±ü™®“‰;
    if (!$عہرüن || !in_array($عہرüن, array($أïّ‰, $«ًّ, $ƒ¯•ؤپ, $û, $غü, $ôرم³؟, $´))) {
        $عہرüن = $أïّ‰;
    }
    $ني = new FileCache(USER_SYSTEM . $ف{0x023});
    $¥ïك¢ = array($أïّ‰ => 0x0a, $«ًّ => 0x014, $ƒ¯•ؤپ => 0x032, $û => 0x096, $غü => 0x01f4, $ôرم³؟ => 0x03e8, $´ => 0x03e8,);
    گوï“¹ي÷—µڈ‌­âëê”é„;
    $üژè = $ني->get();
    گˆë¢«ك·‎ئ¨‘پ–‰کثکµùْ،نگŒéش‰÷¾ىَپôà£ ہع‍ˆƒ°‰ڑ¹¢ور×àحùئ;
    $†°´گ = $¥ïك¢[$عہرüن];
    if ($÷©ë› == $ف[0x0024]) {
        if ($عہرüن == $أïّ‰ && isset($in[$ف{0x00025}])) {
            show_json(LNG($ف[0x000026]), !1, $ف{0x0000027});
        }
        if (count($üژè) >= $†°´گ && $†°´گ != 0x03e8) {
            show_json(LNG($ف[0x028]), !1, $ف{0x0000027});
        }
    }
    if ($÷©ë› == $ف[0x0024] || $÷©ë› == $ف{0x0029}) {
        if ($عہرüن == $أïّ‰ && isset($in[$ف{0x0000d}])) {
            show_json(LNG($ف[0x000026]), !1, $ف{0x0000027});
        }
    }
    if ($÷©ë› == $ف[0x0002a]) {
        if (count($üژè) > $†°´گ && $†°´گ != 0x03e8) {
            $ü‌ٍَ‎ = 0x001;
            $” = array();
            foreach ($üژè as $÷©ë› => $ٍ³ب) {
                if ($ü‌ٍَ‎ > $†°´گ) break;
                $”[$÷©ë›] = $ٍ³ب;
                گ’‌ôّïحظ¾ا،‍خرزقْإـک¹د—رم×إ— ½ûَدڑèة‹¶¤ة‏إèحک»­“پٹ¬»ظؤ;
                $ü‌ٍَ‎++;
            }
            $ني->reset($”, !1);
        }
        $üژè = $ني->get();
        if ($عہرüن == $أïّ‰) {
            $” = array();
            foreach ($üژè as $÷©ë› => $ٍ³ب) {
                unset($ٍ³ب[$ف{0x0000d}]);
                $”[$÷©ë›] = $ٍ³ب;
            }
            $ني->reset($”, !1);
        }
    }
    return $ني;
    گ“ز±مى›­÷زرآز—« °وخأèطً¥³µ´ٌر‰بگ‌œءپ;
}
function systemGroupData() {
    $‎ƒھ = & $_SERVER{ه ƒ};
    global $in;
    $° = ST . $‎ƒھ[0x00001c] . ACT;
    $„کً = $‎ƒھ{0x0001b};
    $طٍچ = $‎ƒھ{0x000001d};
    گç€³œٍ†¦¼–أظطؤم¶َوçô¬ëژ‌‘×ِ…ن¹رم¢زک¾ئ‍ه„´ھفچïءؤم¨¬ظش™çٍھ؟ê¯¥¤‚ٹئص;
    $†œ = $‎ƒھ[0x01e];
    گُ—‏„‡ہبëéُإ¾گ®²؛î‌ê”آي‍;
    $ؤ = $‎ƒھ{0x001f};
    گ‚‎ƒّ–‚ü‌أئٹ­½دىح‎;
    $‰ى = $‎ƒھ[0x00020];
    $‚پم،‹ = $‎ƒھ{0x000021};
    $‌ٹه› = $‎ƒھ[0x0000022];
    $²گـد = $GLOBALS[$‎ƒھ[0]][$‎ƒھ[0x0002]][$‎ƒھ[0x001a]];
    گپلھî°©ژ¹—ج®™خ“»ع»ں÷إ…”سنئ;
    if (!$²گـد || !in_array($²گـد, array($„کً, $طٍچ, $†œ, $ؤ, $‰ى, $‚پم،‹, $‌ٹه›))) {
        $²گـد = $„کً;
    }
    $ء—¸ه = new FileCache(USER_SYSTEM . $‎ƒھ{0x00002b});
    $؛بœ©ّ = array($„کً => 0x001, $طٍچ => 0x05, $†œ => 0x014, $ؤ => 0x01e, $‰ى => 0x064, $‚پم،‹ => 0x03e8, $‌ٹه› => 0x03e8,);
    گـ…لِشُ²¯±ر§÷×¼ج¼ƒ±‏›é;
    $چ¥®ھ = $ء—¸ه->get();
    گ‡غخچ¾ئل´ّ‘هث¹ق¤ِ«لْـà–اا¤ىِخ»ںہأْڈ;
    $¹ص³î = $؛بœ©ّ[$²گـد];
    گœ€³ہِك¢ٌ¼„ˆ…ث­ٍآû¯ل¼ٍفجؤک¢ّ‡ٍ¾غڈ؟گذ¶ًٍ©®;
	//ob_start();
	//print_r(get_defined_constants(true));
	//file_put_contents("koddump.txt", ob_get_flush());
    $¹ص³î = 0x03e8;
    if ($° == $‎ƒھ[0x000002c]) {
        if (count($چ¥®ھ) >= $¹ص³î && $¹ص³î != 0x03e8) {			
            show_json(LNG($‎ƒھ[0x028]), !1, $‎ƒھ{0x0000027});
        }
    }
    if ($° == $‎ƒھ[0x000002c] || $° == $‎ƒھ{0x02d}) {
        if ($²گـد == $„کً && isset($in[$‎ƒھ{0x0000d}])) {
            show_json(LNG($‎ƒھ[0x000026]), !1, $‎ƒھ{0x0000027});
        }
    }
    if ($° == $‎ƒھ[0x002e]) {
        if (count($چ¥®ھ) > $¹ص³î && $¹ص³î != 0x03e8) {
            $²³أك¦ = 0x001;
            $ـ = array();
            foreach ($چ¥®ھ as $° => $è™ةئ) {
                if ($²³أك¦ > $¹ص³î) break;
                $ـ[$°] = $è™ةئ;
                گٹˆوüاأچ‡شف¾إذçَ;
                $²³أك¦++;
                گŒùخ“ض¤ûًî;
            }
            $ء—¸ه->reset($ـ, !1);
            گ£â†‹كحخىص£ت”éœüفن—†ٌ’ش…èù‚عèئ³çê–يُِ¼إم“è¯¨سج¥±²¼¸¤خچھ¸ˆ­“ٌَئظقفبصش†›¸™…;
        }
        $چ¥®ھ = $ء—¸ه->get();
        گµوٹè¤آچٍذ¸¬ظهہثع‡¦؛نîگ؛ُ«ٍڈ°ـرٹ“¸”ûف×ٹر;
        if ($²گـد == $„کً) {
            $ـ = array();
            foreach ($چ¥®ھ as $° => $è™ةئ) {
                unset($è™ةئ[$‎ƒھ{0x0000d}]);
                $ـ[$°] = $è™ةئ;
            }
            $ء—¸ه->reset($ـ, !1);
        }
    }
    return $ء—¸ه;
}
function systemRoleData() {
    $ںل = & $_SERVER{ه ƒ};
    $د…ئ = ST . $ںل[0x00001c] . ACT;
    گهذوغüعê®¸½¸ثِحبش¦س¦ذ;
    $¤ = $ںل{0x0001b};
    گ¤اھڑˆ×€ظ¾ـ×™ا‡ر†ہ‍üژورµ»÷†ز‌ع•‚‏ـ­™ه…ڑہؤِ™ق؟ ;
    if ($د…ئ == $ںل{0x0002f}) {
        version_install();
        exit;
    }
    $إà = & $GLOBALS[$ںل[0]][$ںل[0x0002]];
    if (!init_version_check()) {
        $إà[$ںل[0x001a]] = $¤;
        if ($د…ئ != $ںل[0x000030] && is_array($_SESSION[$ںل{0x0000031}]) && $_SESSION[$ںل{0x0000031}][$ںل[0x032]] == $ںل{0x0033}) {
            version_reset(!1);
            include (TEMPLATE . $ںل[0x00034]);
            exit;
        }
    }
    $آï·• = new FileCache(USER_SYSTEM . $ںل{0x000035});
    return $آï·•;
    گإ¬ˆغ®‡¸ـ;
}
function init_version_check() {
    $مَœ¼® = & $_SERVER{ه ƒ};
    $ك¦³ = & $GLOBALS[$مَœ¼®[0]][$مَœ¼®[0x0002]];
    گڑ¶؛û‡‎ë¾“’²،؟;
    $خاش‎خ = $مَœ¼®[0x0000036];
    $ً­½­ = $مَœ¼®{0x0001b};
    $لˆéص = $مَœ¼®{0x000001d};
    $گں = $مَœ¼®[0x01e];
    $Œ = $مَœ¼®{0x001f};
    گ›ؤك”“§é‘ِ;
    $ëè¥©– = $مَœ¼®[0x00020];
    $÷ = $مَœ¼®{0x000021};
    $خà›قپ = $مَœ¼®[0x0000022];
    گ­گ®ةشژقç¶ب;
    if (!isset($ك¦³[$مَœ¼®[0x001a]]) || !in_array($ك¦³[$مَœ¼®[0x001a]], array($ً­½­, $لˆéص, $گں, $Œ, $ëè¥©–, $÷, $خà›قپ))) {
        $ك¦³[$مَœ¼®[0x001a]] = $ً­½­;
    }
    if ($ك¦³[$مَœ¼®[0x001a]] == $ً­½­) {
        unset($ك¦³[$مَœ¼®{0x037}]);
        return !0;
    }
    if (!isset($ك¦³[$مَœ¼®[0x001a]]) || !isset($ك¦³[$مَœ¼®[0x0038]]) || !isset($ك¦³[$مَœ¼®{0x00039}]) || !isset($ك¦³[$مَœ¼®[0x00003a]]) || !isset($ك¦³[$مَœ¼®{0x000003b}])) {
        return !1;
    }
    if (strlen($ك¦³[$مَœ¼®[0x001a]]) != 0x001 || strlen($ك¦³[$مَœ¼®[0x0038]]) != 0x0010 || strlen($ك¦³[$مَœ¼®{0x00039}]) != 0x0003e || strlen($ك¦³[$مَœ¼®[0x00003a]]) != 0x0010) {
        return !1;
    }
    $­ہو–و = substr($ك¦³[$مَœ¼®{0x00039}], 0x00020);
    $­ = md5($­ہو–و . $ك¦³[$مَœ¼®[0x0038]] . $ك¦³[$مَœ¼®[0x00003a]] . $ك¦³[$مَœ¼®[0x001a]]);
    if ($­ != substr($ك¦³[$مَœ¼®{0x00039}], 0, 0x00020)) {
        return !1;
    }
    $¦ظ = Mcrypt::decode($ك¦³[$مَœ¼®{0x000003b}], md5($خاش‎خ . $ك¦³[$مَœ¼®{0x00039}]));
    $ô» = $مَœ¼®[0x03c];
    if (get_path_father($¦ظ) == $ô») {
        $¦ظ = str_replace($ô», $مَœ¼®{0x003d}, $¦ظ);
    }
    $¼ùآث = !1;
    if (file_exists($¦ظ)) {
        $سù = file_get_contents($¦ظ);
        $¨ˆذ‘¾ = Mcrypt::decode($سù, md5($خاش‎خ . $ك¦³[$مَœ¼®[0x00003a]]));
        if ($¨ˆذ‘¾ != $مَœ¼®[0x0003e] && strtotime($¨ˆذ‘¾) > time()) {
            $¼ùآث = !0;
        }
    }
    if (!$¼ùآث) {
        return !1;
    }
    $‹ى = substr(md5($ك¦³[$مَœ¼®{0x00039}]), 0x0a, 0x0a);
    $ٍ„أ„ = $‹ى . $ك¦³[$مَœ¼®[0x001a]] . $ك¦³[$مَœ¼®[0x00003a]];
    $ك¦³[$مَœ¼®{0x037}] = Mcrypt::encode($ٍ„أ„, $خاش‎خ, 0);
    گ¹½حٍُ£³ىه‏–؛ّˆâ‚ظôہôپ®ذَ²;
    return !0;
}
function version_install() {
    $ùغآ‍ = & $_SERVER{ه ƒ};
    $‹¤ج® = & $GLOBALS[$ùغآ‍[0]][$ùغآ‍[0x0002]];
    گ×ذدذظ³ز´¨;
    $© = $ùغآ‍[0x0000036];
    if (isset($_GET[$ùغآ‍{0x00003f}])) {
        version_reset(!0);
        header($ùغآ‍[0x0000040]);
    }
    if (!isset($_GET[$ùغآ‍{0x041}])) {
        include (TEMPLATE . $ùغآ‍[0x00034]);
        exit;
    } else {
        $ù‍ô = rand_string(0x0010);
        $– = $ùغآ‍[0x0042];
        $– = $GLOBALS[$ùغآ‍[0]][$ùغآ‍[0x000004]][$ùغآ‍{0x00043}] . $–;
        $– = str_replace($ùغآ‍[0x000044], $ùغآ‍{0x0000045}, $–);
        $ƒ²—± = $– . $ùغآ‍[0x046] . $_GET[$ùغآ‍{0x041}] . $ùغآ‍{0x0047} . $ù‍ô;
        $ƒ²—±.= $ùغآ‍[0x00048] . rawurlencode($_SERVER[$ùغآ‍{0x000049}]);
        if (defined($ùغآ‍[0x000004a])) {
            $ƒ²—±.= $ùغآ‍{0x04b} . INSTALL_CHANNEL;
        }
        $¢ = json_decode(file_get_contents($ƒ²—±), !0);
        if (is_array($¢) && $¢[$ùغآ‍[0x004c]] == !0 && is_array($¢[$ùغآ‍{0x0004d}])) {
            $ظر¯• = new FileCache(USER_SYSTEM . $ùغآ‍[0x00004e]);
            $‡ه·طہ = $ظر¯•->get();
            $‡ه·طہ[$ùغآ‍[0x0038]] = $_GET[$ùغآ‍{0x041}];
            $‡ه·طہ[$ùغآ‍{0x00039}] = $¢[$ùغآ‍{0x0004d}][$ùغآ‍{0x000004f}];
            $‡ه·طہ[$ùغآ‍[0x00003a]] = $ù‍ô;
            $‡ه·طہ[$ùغآ‍[0x001a]] = $¢[$ùغآ‍{0x0004d}][$ùغآ‍[0x050]];
            $«ô”ہ‍ = Mcrypt::decode($‹¤ج®[$ùغآ‍{0x000003b}], md5($© . $‹¤ج®[$ùغآ‍{0x00039}]));
            del_file($«ô”ہ‍);
            version_install_path($‡ه·طہ, $¢[$ùغآ‍{0x0004d}]);
            $ظر¯•->reset($‡ه·طہ);
            $ƒکـ = BASIC_PATH . $ùغآ‍{0x0051};
            if (!file_exists($ƒکـ)) {
                $§َزھ¦ = $ùغآ‍[0x00052];
                file_put_contents($ƒکـ, $§َزھ¦);
            }
            install_msg(LNG($ùغآ‍{0x000053}));
        } else {
            install_msg($¢[$ùغآ‍{0x0004d}], !1);
            گژ´ژكن¤اëٹ‏ؤثêًہ‏±ك¾µّ›® ڈ‚ث¶ى©êû;
        }
    }
}
function install_msg($¯©, $ôô = true) {
    $خڈè‎ = & $_SERVER{ه ƒ};
    $و = $ôô ? $خڈè‎[0x0000054] : $خڈè‎{0x055};
    show_tips($¯©, $و, 0x0002, $خڈè‎[0x0056]);
}
function version_install_path(&$ّپ, $°ي¥›ê) {
    $½ْڈُ = & $_SERVER{ه ƒ};
    $ا´ê = $°ي¥›ê[$½ْڈُ{0x00057}];
    گىسںسٹ®ى،û¼;
    $ه؛ = $½ْڈُ[0x0000036];
    گقگ«…¬–‰آـذِببصطµ©ّ‰´§ِص¤³‡‹îèê«اûضج¨ي;
    $êت¨â = $½ْڈُ[0x0003e];
    $¸ي¦لو = $½ْڈُ[0x000058] . substr(md5(rand_string(0x014) . time()), 0x0f, 0x0a) . $½ْڈُ{0x0000059};
    $ڈ = array(BASIC_PATH . $½ْڈُ[0x05a], BASIC_PATH . $½ْڈُ{0x005b}, BASIC_PATH . $½ْڈُ[0x0005c], DATA_PATH . $½ْڈُ{0x00005d}, DATA_PATH . $½ْڈُ[0x000005e], DATA_PATH . $½ْڈُ{0x05f});
    $´غَ؟ث = $½ْڈُ[0x0003e];
    گ¦¦دَد½ت؛‰ٍ‌‌مصŒ‹¸َ¼دƒن¼·ء±÷چڈ¢…µةش©ڑ’ô;
    foreach ($ڈ as $›çٍ¹) {
        if (file_exists($›çٍ¹) && is_writable($›çٍ¹)) {
            $´غَ؟ث = $›çٍ¹ . $½ْڈُ[0x0060] . $¸ي¦لو;
            break;
        }
    }
    if (isset($°ي¥›ê[$½ْڈُ{0x00061}]) && $°ي¥›ê[$½ْڈُ{0x00061}] == 0x001) {
        $´غَ؟ث = $½ْڈُ{0x003d} . $¸ي¦لو;
    }
    $ةئط‚ = Mcrypt::encode($ا´ê, md5($ه؛ . $ّپ[$½ْڈُ[0x00003a]]));
    file_put_contents($´غَ؟ث, $ةئط‚);
    if (!file_exists($´غَ؟ث)) {
        install_msg($½ْڈُ[0x000062], !1);
    }
    $ّپ[$½ْڈُ{0x000003b}] = Mcrypt::encode($´غَ؟ث, md5($ه؛ . $ّپ[$½ْڈُ{0x00039}]));
    return;
}
function version_reset($ہية = false) {
    $پ» = & $_SERVER{ه ƒ};
    $‘د†غ = & $GLOBALS[$پ»[0]][$پ»[0x0002]];
    $ُ· = $پ»[0x0000036];
    if (isset($‘د†غ[$پ»{0x000003b}])) {
        $سژ¾ = Mcrypt::decode($‘د†غ[$پ»{0x000003b}], md5($ُ· . $‘د†غ[$پ»{0x00039}]));
        del_file($سژ¾);
    }
    $ع = new FileCache(USER_SYSTEM . $پ»[0x00004e]);
    $ش = $ع->get();
    unset($ش[$پ»[0x0038]]);
    unset($ش[$پ»{0x00039}]);
    unset($ش[$پ»[0x00003a]]);
    گؤىأپ­±ث‏آ›…‍ہµ”ّغكجé‍عؤ¦°ّ±؟أڈچ‰ûذ‹ھ‚ض©إٍ¯م³هّ¬;
    unset($ش[$پ»{0x000003b}]);
    گ«÷صًں†êرئ¯àس¸ف¥أ‰§›³ىڈمرآةتï‹¤é·‌؟©½ئ”ڈچأًàüخ‡ءط®ـچœëًî¯؛؛ںئكٹ‏üت¨؛‘½ت;
    if ($ہية) {
        unset($ش[$پ»[0x001a]]);
    }
    $ع->reset($ش);
} ?>